---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.TreadFrontProfileInvalid
source: html/44f898d0-833b-343c-3952-d6ab14173c93.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.TreadFrontProfileInvalid Property

This profile cannot be used for the front of treads. Please choose a profile composed of a closed loop of lines with exactly one lines coincident with the y-axis. This lines will define the connection of this profile to the tread.

## Syntax (C#)
```csharp
public static FailureDefinitionId TreadFrontProfileInvalid { get; }
```